# Group Type Id View Positioning Property

Source: https://www.revitapidocs.com/2026/d2986987-b863-4b54-c8f0-a7187fea9671.htm

---

| Group Type Id View Positioning Property |
| --- |

View to Sheet Positioning.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ViewPositioning { get; }
```

```
Public Shared ReadOnly Property ViewPositioning As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ViewPositioning {
	ForgeTypeId^ get ();
}
```

```
static member ViewPositioning : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

GroupTypeId Class Autodesk.Revit.DB Namespace